<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# SQL string functions
© ExploreAI Academy

In this exercise, we will use string functions to filter our data in order to extract relevant information.

## Learning objectives

By the end of this train, you should be able to:
- Use the `LIKE` operator to filter text data.
- Use the `LOWER` and `UPPER` functions to query text data.
- Concatenate text data from multiple columns.

First, let's load our sample database:

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [2]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

Connecting to 'sqlite:///chinook.db'

Here is a [view](https://www.lucidchart.com/pages/er-diagrams) of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:70%";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

[Image source](https://www.sqlitetutorial.net/sqlite-sample-database/)

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Run a query that will give us a view of the data type of the customers table.

In [3]:
%%sql

PRAGMA table_info(customers);

Running query in 'sqlite:///chinook.db'

+-----+------------+--------------+---------+------------+----+
| cid |    name    |     type     | notnull | dflt_value | pk |
+-----+------------+--------------+---------+------------+----+
|  0  | CustomerId |   INTEGER    |    1    |    None    | 1  |
|  1  | FirstName  | NVARCHAR(40) |    1    |    None    | 0  |
|  2  |  LastName  | NVARCHAR(20) |    1    |    None    | 0  |
|  3  |  Company   | NVARCHAR(80) |    0    |    None    | 0  |
|  4  |  Address   | NVARCHAR(70) |    0    |    None    | 0  |
|  5  |    City    | NVARCHAR(40) |    0    |    None    | 0  |
|  6  |   State    | NVARCHAR(40) |    0    |    None    | 0  |
|  7  |  Country   | NVARCHAR(40) |    0    |    None    | 0  |
|  8  | PostalCode | NVARCHAR(10) |    0    |    None    | 0  |
|  9  |   Phone    | NVARCHAR(24) |    0    |    None    | 0  |
+-----+------------+--------------+---------+------------+----+
Truncated to displaylimit of 10.

### Exercise 2


Write a query that will return all the columns for the tracks that contain the word love.

Limit this to the first 10 results.

In [5]:
%%sql 

SELECT 
    * 
FROM 
    tracks AS t
WHERE 
    t.Name LIKE "%love%"
LIMIT 10;

Running query in 'sqlite:///chinook.db'

+---------+----------------------------------------------+---------+-------------+---------+------------------------------------------------------------------+--------------+----------+-----------+
| TrackId |                     Name                     | AlbumId | MediaTypeId | GenreId |                             Composer                             | Milliseconds |  Bytes   | UnitPrice |
+---------+----------------------------------------------+---------+-------------+---------+------------------------------------------------------------------+--------------+----------+-----------+
|    24   |             Love In An Elevator              |    5    |      1      |    1    |                     Steven Tyler, Joe Perry                      |    321828    | 10552051 |    0.99   |
|    56   |               Love, Hate, Love               |    7    |      1      |    1    |                   Jerry Cantrell, Layne Staley                   |    387134    | 12575396 |    0.99   |
|   195   |             Let Me Love You Baby             |    20   |      1      |    6    |                           Willie Dixon                           |    175386    | 5716994  |    0.99   |
|   335   |                   My Love                    |    29   |      1      |    9    |                         Jauperi/Zeu Góes                         |    203493    | 6772813  |    0.99   |
|   341   | The Girl I Love She Got Long Black Wavy Hair |    30   |      1      |    1    |  Jimmy Page/John Bonham/John Estes/John Paul Jones/Robert Plant  |    183327    | 5995686  |    0.99   |
|   345   |               Whole Lotta Love               |    30   |      1      |    1    | Jimmy Page/John Bonham/John Paul Jones/Robert Plant/Willie Dixon |    373394    | 12258175 |    0.99   |
|   413   |                   Loverman                   |    35   |      1      |    3    |                               Cave                               |    472764    | 15446975 |    0.99   |
|   440   |                   Love Gun                   |    37   |      1      |    1    |                           Paul Stanley                           |    196257    | 6424915  |    0.99   |
|   444   |                Do You Love Me                |    37   |      1      |    1    |                Paul Stanley, B. Ezrin, K. Fowley                 |    214987    | 6976194  |    0.99   |
|   449   |               Calling Dr. Love               |    37   |      1      |    1    |                           Gene Simmons                           |    225332    | 7395034  |    0.99   |
+---------+----------------------------------------------+---------+-------------+---------+------------------------------------------------------------------+--------------+----------+-----------+
Truncated to displaylimit of 10.

### Exercise 3


Write a query that returns all customers whose first name starts with the letter D.

In [7]:
%%sql

SELECT 
    *
FROM 
    customers AS c
WHERE 
    c.FirstName LIKE "D%";

Running query in 'sqlite:///chinook.db'

+------------+-----------+-----------+---------+----------------------+---------------+-------+-----------+------------+---------------------+------+-----------------------------+--------------+
| CustomerId | FirstName |  LastName | Company |       Address        |      City     | State |  Country  | PostalCode |        Phone        | Fax  |            Email            | SupportRepId |
+------------+-----------+-----------+---------+----------------------+---------------+-------+-----------+------------+---------------------+------+-----------------------------+--------------+
|     8      |    Daan   |  Peeters  |   None  |   Grétrystraat 63    |    Brussels   |  None |  Belgium  |    1000    |   +32 02 219 03 03  | None |    daan_peeters@apple.be    |      4       |
|     20     |    Dan    |   Miller  |   None  | 541 Del Medio Avenue | Mountain View |   CA  |    USA    | 94040-111  |  +1 (650) 644-3358  | None |     dmiller@comcast.com     |      4       |
|     40     | Dominique |  Lefebvre |   None  |    8, Rue Hanovre    |     Paris     |  None |   France  |   75002    |  +33 01 47 42 71 71 | None | dominiquelefebvre@gmail.com |      4       |
|     56     |   Diego   | Gutiérrez |   None  |  307 Macacha Güemes  |  Buenos Aires |  None | Argentina |    1106    | +54 (0)11 4311 4333 | None |   diego.gutierrez@yahoo.ar  |      4       |
+------------+-----------+-----------+---------+----------------------+---------------+-------+-----------+------------+---------------------+------+-----------------------------+--------------+

### Exercise 4

Formulate a query that returns customers with email addresses that have domains that end in three letters.

In [9]:
%%sql

SELECT *
FROM customers AS c
WHERE c.Email LIKE "%.___"
LIMIT 5;

Running query in 'sqlite:///chinook.db'

+------------+-----------+-------------+-----------------------+---------------------------+---------------+-------+----------------+------------+-------------------+-------------------+--------------------------+--------------+
| CustomerId | FirstName |   LastName  |        Company        |          Address          |      City     | State |    Country     | PostalCode |       Phone       |        Fax        |          Email           | SupportRepId |
+------------+-----------+-------------+-----------------------+---------------------------+---------------+-------+----------------+------------+-------------------+-------------------+--------------------------+--------------+
|     3      |  François |   Tremblay  |          None         |     1498 rue Bélanger     |    Montréal   |   QC  |     Canada     |  H2G 1A7   | +1 (514) 721-4711 |        None       |   ftremblay@gmail.com    |      3       |
|     5      | František | Wichterlová |    JetBrains s.r.o.   |       Klanova 9/506       |     Prague    |  None | Czech Republic |   14700    |  +420 2 4172 5555 |  +420 2 4172 5555 | frantisekw@jetbrains.com |      4       |
|     6      |   Helena  |     Holý    |          None         |       Rilská 3174/6       |     Prague    |  None | Czech Republic |   14300    |  +420 2 4177 0449 |        None       |     hholy@gmail.com      |      5       |
|     16     |   Frank   |    Harris   |      Google Inc.      | 1600 Amphitheatre Parkway | Mountain View |   CA  |      USA       | 94043-1351 | +1 (650) 253-0000 | +1 (650) 253-0000 |    fharris@google.com    |      4       |
|     17     |    Jack   |    Smith    | Microsoft Corporation |      1 Microsoft Way      |    Redmond    |   WA  |      USA       | 98052-8300 | +1 (425) 882-8080 | +1 (425) 882-8081 | jacksmith@microsoft.com  |      5       |
+------------+-----------+-------------+-----------------------+---------------------------+---------------+-------+----------------+------------+-------------------+-------------------+--------------------------+--------------+

### Exercise 5

Write a query that shows all customers who live in the UK.

In [11]:
%%sql

SELECT 
    *
FROM 
    customers
WHERE 
    LOWER(country) = "united kingdom";

Running query in 'sqlite:///chinook.db'

+------------+-----------+----------+---------+-------------------+------------+-------+----------------+------------+-------------------+------+------------------------+--------------+
| CustomerId | FirstName | LastName | Company |      Address      |    City    | State |    Country     | PostalCode |       Phone       | Fax  |         Email          | SupportRepId |
+------------+-----------+----------+---------+-------------------+------------+-------+----------------+------------+-------------------+------+------------------------+--------------+
|     52     |    Emma   |  Jones   |   None  | 202 Hoxton Street |   London   |  None | United Kingdom |   N1 5LH   | +44 020 7707 0707 | None | emma_jones@hotmail.com |      3       |
|     53     |    Phil   |  Hughes  |   None  |    113 Lupus St   |   London   |  None | United Kingdom |  SW1V 3EN  | +44 020 7976 5722 | None | phil.hughes@gmail.com  |      3       |
|     54     |   Steve   |  Murray  |   None  |   110 Raeburn Pl  | Edinburgh  |  None | United Kingdom |  EH4 1HH   | +44 0131 315 3300 | None | steve.murray@yahoo.uk  |      5       |
+------------+-----------+----------+---------+-------------------+------------+-------+----------------+------------+-------------------+------+------------------------+--------------+

### Exercise 6
Write a query that shows employee first and last names in the same column.

In [13]:
%%sql

SELECT FirstName || " " || LastName AS "Full Name"
FROM employees;

Running query in 'sqlite:///chinook.db'

+------------------+
|    Full Name     |
+------------------+
|   Andrew Adams   |
|  Nancy Edwards   |
|   Jane Peacock   |
|  Margaret Park   |
|  Steve Johnson   |
| Michael Mitchell |
|   Robert King    |
|  Laura Callahan  |
+------------------+

## Solutions

### Exercise 1

In [4]:
%%sql

PRAGMA table_info(customers);

Running query in 'sqlite:///chinook.db'

+-----+------------+--------------+---------+------------+----+
| cid |    name    |     type     | notnull | dflt_value | pk |
+-----+------------+--------------+---------+------------+----+
|  0  | CustomerId |   INTEGER    |    1    |    None    | 1  |
|  1  | FirstName  | NVARCHAR(40) |    1    |    None    | 0  |
|  2  |  LastName  | NVARCHAR(20) |    1    |    None    | 0  |
|  3  |  Company   | NVARCHAR(80) |    0    |    None    | 0  |
|  4  |  Address   | NVARCHAR(70) |    0    |    None    | 0  |
|  5  |    City    | NVARCHAR(40) |    0    |    None    | 0  |
|  6  |   State    | NVARCHAR(40) |    0    |    None    | 0  |
|  7  |  Country   | NVARCHAR(40) |    0    |    None    | 0  |
|  8  | PostalCode | NVARCHAR(10) |    0    |    None    | 0  |
|  9  |   Phone    | NVARCHAR(24) |    0    |    None    | 0  |
+-----+------------+--------------+---------+------------+----+
Truncated to displaylimit of 10.

### Exercise 2

In [6]:
%%sql 

SELECT 
    * 
FROM 
    tracks AS t
WHERE 
    t.Name LIKE "%love%"
LIMIT 10;

Running query in 'sqlite:///chinook.db'

+---------+----------------------------------------------+---------+-------------+---------+------------------------------------------------------------------+--------------+----------+-----------+
| TrackId |                     Name                     | AlbumId | MediaTypeId | GenreId |                             Composer                             | Milliseconds |  Bytes   | UnitPrice |
+---------+----------------------------------------------+---------+-------------+---------+------------------------------------------------------------------+--------------+----------+-----------+
|    24   |             Love In An Elevator              |    5    |      1      |    1    |                     Steven Tyler, Joe Perry                      |    321828    | 10552051 |    0.99   |
|    56   |               Love, Hate, Love               |    7    |      1      |    1    |                   Jerry Cantrell, Layne Staley                   |    387134    | 12575396 |    0.99   |
|   195   |             Let Me Love You Baby             |    20   |      1      |    6    |                           Willie Dixon                           |    175386    | 5716994  |    0.99   |
|   335   |                   My Love                    |    29   |      1      |    9    |                         Jauperi/Zeu Góes                         |    203493    | 6772813  |    0.99   |
|   341   | The Girl I Love She Got Long Black Wavy Hair |    30   |      1      |    1    |  Jimmy Page/John Bonham/John Estes/John Paul Jones/Robert Plant  |    183327    | 5995686  |    0.99   |
|   345   |               Whole Lotta Love               |    30   |      1      |    1    | Jimmy Page/John Bonham/John Paul Jones/Robert Plant/Willie Dixon |    373394    | 12258175 |    0.99   |
|   413   |                   Loverman                   |    35   |      1      |    3    |                               Cave                               |    472764    | 15446975 |    0.99   |
|   440   |                   Love Gun                   |    37   |      1      |    1    |                           Paul Stanley                           |    196257    | 6424915  |    0.99   |
|   444   |                Do You Love Me                |    37   |      1      |    1    |                Paul Stanley, B. Ezrin, K. Fowley                 |    214987    | 6976194  |    0.99   |
|   449   |               Calling Dr. Love               |    37   |      1      |    1    |                           Gene Simmons                           |    225332    | 7395034  |    0.99   |
+---------+----------------------------------------------+---------+-------------+---------+------------------------------------------------------------------+--------------+----------+-----------+
Truncated to displaylimit of 10.

### Exercise 3

In [8]:
%%sql

SELECT 
    *
FROM 
    customers AS c
WHERE 
    c.FirstName LIKE "D%";

Running query in 'sqlite:///chinook.db'

+------------+-----------+-----------+---------+----------------------+---------------+-------+-----------+------------+---------------------+------+-----------------------------+--------------+
| CustomerId | FirstName |  LastName | Company |       Address        |      City     | State |  Country  | PostalCode |        Phone        | Fax  |            Email            | SupportRepId |
+------------+-----------+-----------+---------+----------------------+---------------+-------+-----------+------------+---------------------+------+-----------------------------+--------------+
|     8      |    Daan   |  Peeters  |   None  |   Grétrystraat 63    |    Brussels   |  None |  Belgium  |    1000    |   +32 02 219 03 03  | None |    daan_peeters@apple.be    |      4       |
|     20     |    Dan    |   Miller  |   None  | 541 Del Medio Avenue | Mountain View |   CA  |    USA    | 94040-111  |  +1 (650) 644-3358  | None |     dmiller@comcast.com     |      4       |
|     40     | Dominique |  Lefebvre |   None  |    8, Rue Hanovre    |     Paris     |  None |   France  |   75002    |  +33 01 47 42 71 71 | None | dominiquelefebvre@gmail.com |      4       |
|     56     |   Diego   | Gutiérrez |   None  |  307 Macacha Güemes  |  Buenos Aires |  None | Argentina |    1106    | +54 (0)11 4311 4333 | None |   diego.gutierrez@yahoo.ar  |      4       |
+------------+-----------+-----------+---------+----------------------+---------------+-------+-----------+------------+---------------------+------+-----------------------------+--------------+

### Exercise 4

In [10]:
%%sql

SELECT *
FROM customers AS c
WHERE c.Email LIKE "%.___"
LIMIT 5;

Running query in 'sqlite:///chinook.db'

+------------+-----------+-------------+-----------------------+---------------------------+---------------+-------+----------------+------------+-------------------+-------------------+--------------------------+--------------+
| CustomerId | FirstName |   LastName  |        Company        |          Address          |      City     | State |    Country     | PostalCode |       Phone       |        Fax        |          Email           | SupportRepId |
+------------+-----------+-------------+-----------------------+---------------------------+---------------+-------+----------------+------------+-------------------+-------------------+--------------------------+--------------+
|     3      |  François |   Tremblay  |          None         |     1498 rue Bélanger     |    Montréal   |   QC  |     Canada     |  H2G 1A7   | +1 (514) 721-4711 |        None       |   ftremblay@gmail.com    |      3       |
|     5      | František | Wichterlová |    JetBrains s.r.o.   |       Klanova 9/506       |     Prague    |  None | Czech Republic |   14700    |  +420 2 4172 5555 |  +420 2 4172 5555 | frantisekw@jetbrains.com |      4       |
|     6      |   Helena  |     Holý    |          None         |       Rilská 3174/6       |     Prague    |  None | Czech Republic |   14300    |  +420 2 4177 0449 |        None       |     hholy@gmail.com      |      5       |
|     16     |   Frank   |    Harris   |      Google Inc.      | 1600 Amphitheatre Parkway | Mountain View |   CA  |      USA       | 94043-1351 | +1 (650) 253-0000 | +1 (650) 253-0000 |    fharris@google.com    |      4       |
|     17     |    Jack   |    Smith    | Microsoft Corporation |      1 Microsoft Way      |    Redmond    |   WA  |      USA       | 98052-8300 | +1 (425) 882-8080 | +1 (425) 882-8081 | jacksmith@microsoft.com  |      5       |
+------------+-----------+-------------+-----------------------+---------------------------+---------------+-------+----------------+------------+-------------------+-------------------+--------------------------+--------------+

One of the most useful string operators in SQL is the `LIKE` operator. This allows us to search for a pattern of text within a table column.

`LIKE` is used in the `WHERE` clause in conjunction with wildcards. Examples include:

- `%`: represents zero, one, or multiple characters
- `_`: represents a single character

### Exercise 5

In [12]:
%%sql

SELECT 
    *
FROM 
    customers
WHERE 
    LOWER(country) = "united kingdom";

Running query in 'sqlite:///chinook.db'

+------------+-----------+----------+---------+-------------------+------------+-------+----------------+------------+-------------------+------+------------------------+--------------+
| CustomerId | FirstName | LastName | Company |      Address      |    City    | State |    Country     | PostalCode |       Phone       | Fax  |         Email          | SupportRepId |
+------------+-----------+----------+---------+-------------------+------------+-------+----------------+------------+-------------------+------+------------------------+--------------+
|     52     |    Emma   |  Jones   |   None  | 202 Hoxton Street |   London   |  None | United Kingdom |   N1 5LH   | +44 020 7707 0707 | None | emma_jones@hotmail.com |      3       |
|     53     |    Phil   |  Hughes  |   None  |    113 Lupus St   |   London   |  None | United Kingdom |  SW1V 3EN  | +44 020 7976 5722 | None | phil.hughes@gmail.com  |      3       |
|     54     |   Steve   |  Murray  |   None  |   110 Raeburn Pl  | Edinburgh  |  None | United Kingdom |  EH4 1HH   | +44 0131 315 3300 | None | steve.murray@yahoo.uk  |      5       |
+------------+-----------+----------+---------+-------------------+------------+-------+----------------+------------+-------------------+------+------------------------+--------------+

When filtering on string columns, it's best to use the `UPPER` or `LOWER` functions so as to not exclude any entries that might differ based on their case.

### Exercise 6

In [14]:
%%sql

SELECT FirstName || " " || LastName AS "Full Name"
FROM employees;

Running query in 'sqlite:///chinook.db'

+------------------+
|    Full Name     |
+------------------+
|   Andrew Adams   |
|  Nancy Edwards   |
|   Jane Peacock   |
|  Margaret Park   |
|  Steve Johnson   |
| Michael Mitchell |
|   Robert King    |
|  Laura Callahan  |
+------------------+

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>